---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.PlumbingUtils
source: html/82f7454b-199c-0779-4a99-89ac6c58f5a4.htm
---
# PlumbingUtils Methods

Breaks the pipe curve into two parts at the given position.